nvme/bk/xarray-v5/linked-list6.fio.log
test1: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test2: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test3: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test4: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test5: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test6: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test7: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test8: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test9: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test10: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test11: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test12: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test13: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test14: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test15: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test16: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test17: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test18: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test19: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test20: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test21: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test22: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test23: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test24: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test25: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test26: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test27: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test28: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test29: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test30: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test31: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test32: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
fio-3.8-5-g464b
Starting 32 processes

test1: (groupid=0, jobs=32): err= 0: pid=28923: Wed Aug  5 19:25:06 2020
   read: IOPS=1555k, BW=6073MiB/s (6368MB/s)(356GiB/60002msec)
    slat (usec): min=2, max=1081, avg= 4.90, stdev= 1.35
    clat (usec): min=8, max=12584, avg=35.46, stdev= 8.36
     lat (usec): min=21, max=12587, avg=40.44, stdev= 8.55
    clat percentiles (usec):
     |  1.00th=[   26],  5.00th=[   27], 10.00th=[   28], 20.00th=[   29],
     | 30.00th=[   30], 40.00th=[   31], 50.00th=[   33], 60.00th=[   39],
     | 70.00th=[   41], 80.00th=[   43], 90.00th=[   45], 95.00th=[   48],
     | 99.00th=[   56], 99.50th=[   59], 99.90th=[   67], 99.95th=[   75],
     | 99.99th=[  108]
   bw (  KiB/s): min=127800, max=241392, per=3.12%, avg=194344.13, stdev=30108.73, samples=3808
   iops        : min=31950, max=60348, avg=48586.00, stdev=7527.18, samples=3808
  lat (usec)   : 10=0.01%, 20=0.01%, 50=97.18%, 100=2.81%, 250=0.02%
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%
  cpu          : usr=6.99%, sys=29.45%, ctx=46645881, majf=0, minf=434
  IO depths    : 1=0.1%, 2=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=93291240,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=2

Run status group 0 (all jobs):
   READ: bw=6073MiB/s (6368MB/s), 6073MiB/s-6073MiB/s (6368MB/s-6368MB/s), io=356GiB (382GB), run=60002-60002msec

Disk stats (read/write):
  nvme2n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n2: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n3: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n4: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n5: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n6: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n7: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n8: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n9: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n10: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n11: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n12: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n13: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n14: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n15: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n16: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n113: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n114: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n115: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n116: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n117: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n118: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n119: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n120: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n121: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n122: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n123: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n124: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n125: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n126: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n127: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n128: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%